Revit 2027 API
RebarConstraint.GetRebarConstrainedHandle Method
 Gets the RebarConstrainedHandle for which this constraint is.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstrainedHandle GetRebarConstrainedHandle()
Public Function GetRebarConstrainedHandle As RebarConstrainedHandle
public:
RebarConstrainedHandle^ GetRebarConstrainedHandle()
member GetRebarConstrainedHandle : unit -> RebarConstrainedHandle
Return Value
RebarConstrainedHandle
 Returns the RebarConstrainedHandle for which this constraint is.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace